The Github action plan:


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.eks will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "eks" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # data.aws_eks_cluster_auth.eks will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "eks" {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.eks_cluster.data.aws_iam_policy_document.eks_admin will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "eks_admin" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "eks:CreateFargateProfile",
              + "eks:CreateNodegroup",
              + "eks:ListClusters",
              + "eks:ListNodegroups",
              + "eks:ListTagsForResource",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "AllowEKSReadActions"
        }
      + statement {
          + actions   = [
              + "eks:AccessKubernetesApi",
              + "eks:DeleteNodegroup",
              + "eks:DescribeCluster",
              + "eks:DescribeFargateProfile",
              + "eks:DescribeIdentityProviderConfig",
              + "eks:DescribeNodegroup",
              + "eks:DescribeUpdate",
              + "eks:ListFargateProfiles",
              + "eks:ListUpdates",
              + "eks:TagResource",
              + "eks:UntagResource",
              + "eks:UpdateClusterConfig",
              + "eks:UpdateNodegroupConfig",
              + "eks:UpdateNodegroupVersion",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "AllowEKSUpdateActions"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:ResourceTag/Name"
            }
        }
      + statement {
          + actions   = [
              + "ec2:*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "AllowEC2Actions"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:ResourceTag/aws:eks:cluster-name"
            }
        }
      + statement {
          + actions   = [
              + "autoscaling:*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "AllowAutoscalingActions"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:ResourceTag/eks:cluster-name"
            }
        }
      + statement {
          + actions   = [
              + "elasticloadbalancing:*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "AllowELBActions"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:ResourceTag/Name"
            }
        }
    }

  # module.eks_cluster.aws_iam_role.eks_admin will be created
  + resource "aws_iam_role" "eks_admin" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::804295906245:root"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks_cluster.kubernetes_namespace.default_namespace[0] will be created
  + resource "kubernetes_namespace" "default_namespace" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "sf-ref-arch"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks_cluster.module.eks_cluster.data.tls_certificate.cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "cluster" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks_cluster.module.eks_cluster.aws_cloudwatch_log_group.default[0] will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/eks/nat-gateway-himanshu-arc-training-k8s-cluster/cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Attributes"  = "cluster"
          + "Environment" = "arc"
          + "Name"        = "nat-gateway-himanshu-arc-training-k8s-cluster"
          + "Namespace"   = "nat-gateway-himanshu"
        }
      + tags_all          = {
          + "Attributes"  = "cluster"
          + "Environment" = "arc"
          + "Name"        = "nat-gateway-himanshu-arc-training-k8s-cluster"
          + "Namespace"   = "nat-gateway-himanshu"
        }
    }

  # module.eks_cluster.module.eks_cluster.aws_eks_cluster.default[0] will be created
  + resource "aws_eks_cluster" "default" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "nat-gateway-himanshu-arc-training-k8s-cluster"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Attributes"  = "cluster"
          + "Environment" = "arc"
          + "Name"        = "nat-gateway-himanshu-arc-training-k8s-cluster"
          + "Namespace"   = "nat-gateway-himanshu"
        }
      + tags_all                  = {
          + "Attributes"  = "cluster"
          + "Environment" = "arc"
          + "Name"        = "nat-gateway-himanshu-arc-training-k8s-cluster"
          + "Namespace"   = "nat-gateway-himanshu"
        }
      + version                   = "1.28"

      + access_config (known after apply)

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + subnet_ids                = [
              + "subnet-067df0f2dfef91d89",
              + "subnet-08450aa36c60f90a3",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks_cluster.module.eks_cluster.aws_iam_openid_connect_provider.default[0] will be created
  + resource "aws_iam_openid_connect_provider" "default" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Attributes"  = "cluster"
          + "Environment" = "arc"
          + "Name"        = "nat-gateway-himanshu-arc-training-k8s-cluster"
          + "Namespace"   = "nat-gateway-himanshu"
        }
      + tags_all        = {
          + "Attributes"  = "cluster"
          + "Environment" = "arc"
          + "Name"        = "nat-gateway-himanshu-arc-training-k8s-cluster"
          + "Namespace"   = "nat-gateway-himanshu"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks_cluster.module.eks_cluster.aws_iam_policy.cluster_elb_service_role[0] will be created
  + resource "aws_iam_policy" "cluster_elb_service_role" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "nat-gateway-himanshu-arc-training-k8s-cluster-ServiceRole"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAccountAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowElasticLoadBalancer"
                    },
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Deny"
                      + Resource = "*"
                      + Sid      = "DenyCreateLogGroup"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.eks_cluster.module.eks_cluster.aws_iam_role.default[0] will be created
  + resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "nat-gateway-himanshu-arc-training-k8s-cluster"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Attributes"  = "cluster"
          + "Environment" = "arc"
          + "Name"        = "nat-gateway-himanshu-arc-training-k8s-cluster"
          + "Namespace"   = "nat-gateway-himanshu"
        }
      + tags_all              = {
          + "Attributes"  = "cluster"
          + "Environment" = "arc"
          + "Name"        = "nat-gateway-himanshu-arc-training-k8s-cluster"
          + "Namespace"   = "nat-gateway-himanshu"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks_cluster.module.eks_cluster.aws_iam_role_policy_attachment.amazon_eks_cluster_policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "amazon_eks_cluster_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "nat-gateway-himanshu-arc-training-k8s-cluster"
    }

  # module.eks_cluster.module.eks_cluster.aws_iam_role_policy_attachment.amazon_eks_service_policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "amazon_eks_service_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = "nat-gateway-himanshu-arc-training-k8s-cluster"
    }

  # module.eks_cluster.module.eks_cluster.aws_iam_role_policy_attachment.cluster_elb_service_role[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_elb_service_role" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "nat-gateway-himanshu-arc-training-k8s-cluster"
    }

  # module.eks_cluster.module.eks_cluster.aws_kms_alias.cluster[0] will be created
  + resource "aws_kms_alias" "cluster" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/nat-gateway-himanshu-arc-training-k8s-cluster"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.eks_cluster.module.eks_cluster.aws_kms_key.cluster[0] will be created
  + resource "aws_kms_key" "cluster" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "EKS Cluster nat-gateway-himanshu-arc-training-k8s-cluster Encryption Config KMS Key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Attributes"  = "cluster"
          + "Environment" = "arc"
          + "Name"        = "nat-gateway-himanshu-arc-training-k8s-cluster"
          + "Namespace"   = "nat-gateway-himanshu"
        }
      + tags_all                           = {
          + "Attributes"  = "cluster"
          + "Environment" = "arc"
          + "Name"        = "nat-gateway-himanshu-arc-training-k8s-cluster"
          + "Namespace"   = "nat-gateway-himanshu"
        }
    }

  # module.eks_cluster.module.eks_cluster.kubernetes_config_map.aws_auth_ignore_changes[0] will be created
  + resource "kubernetes_config_map" "aws_auth_ignore_changes" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks_cluster.module.eks_cluster.null_resource.wait_for_cluster[0] will be created
  + resource "null_resource" "wait_for_cluster" {
      + id = (known after apply)
    }

  # module.eks_cluster.module.eks_node_group.aws_eks_node_group.default[0] will be created
  + resource "aws_eks_node_group" "default" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = (known after apply)
      + disk_size              = (known after apply)
      + force_update_version   = false
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "nat-gateway-himanshu-arc-training-k8s-workers"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-067df0f2dfef91d89",
          + "subnet-08450aa36c60f90a3",
        ]
      + tags                   = (known after apply)
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 1
        }

      + update_config (known after apply)
    }

  # module.eks_cluster.module.eks_node_group.aws_iam_policy.ipv6_eks_cni_policy[0] will be created
  + resource "aws_iam_policy" "ipv6_eks_cni_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "nat-gateway-himanshu-arc-training-k8s-CNI_Policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:UnassignPrivateIpAddresses",
                          + "ec2:ModifyNetworkInterfaceAttribute",
                          + "ec2:DetachNetworkInterface",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:AttachNetworkInterface",
                          + "ec2:AssignPrivateIpAddresses",
                          + "ec2:AssignIpv6Addresses",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "ec2:CreateTags"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:*:*:network-interface/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.eks_cluster.module.eks_node_group.aws_iam_role.default[0] will be created
  + resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "nat-gateway-himanshu-arc-training-k8s-workers"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Attributes"  = "workers"
          + "Environment" = "arc"
          + "Name"        = "nat-gateway-himanshu-arc-training-k8s-workers"
          + "Namespace"   = "nat-gateway-himanshu"
        }
      + tags_all              = {
          + "Attributes"  = "workers"
          + "Environment" = "arc"
          + "Name"        = "nat-gateway-himanshu-arc-training-k8s-workers"
          + "Namespace"   = "nat-gateway-himanshu"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks_cluster.module.eks_node_group.aws_iam_role_policy_attachment.amazon_ec2_container_registry_read_only[0] will be created
  + resource "aws_iam_role_policy_attachment" "amazon_ec2_container_registry_read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "nat-gateway-himanshu-arc-training-k8s-workers"
    }

  # module.eks_cluster.module.eks_node_group.aws_iam_role_policy_attachment.amazon_eks_worker_node_policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "amazon_eks_worker_node_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "nat-gateway-himanshu-arc-training-k8s-workers"
    }

  # module.eks_cluster.module.eks_node_group.aws_iam_role_policy_attachment.ipv6_eks_cni_policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "ipv6_eks_cni_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "nat-gateway-himanshu-arc-training-k8s-workers"
    }

  # module.eks_cluster.module.eks_node_group.aws_launch_template.default[0] will be created
  + resource "aws_launch_template" "default" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + ebs_optimized          = "true"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "nat-gateway-himanshu-arc-training-k8s-workers"
      + tags                   = (known after apply)
      + tags_all               = (known after apply)
      + update_default_version = true

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + iops                  = (known after apply)
              + throughput            = (known after apply)
              + volume_size           = 20
              + volume_type           = "gp3"
            }
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = false
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = (known after apply)
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = (known after apply)
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = (known after apply)
        }
    }

Plan: 21 to add, 0 to change, 0 to destroy.
